In [ ]:
#iVeman : Pandas Operations

In [1]:
import pandas as pd
import numpy as np

In [2]:
p_id = [2000,2001,2002,2003,2004]
p_name = ['Veman','Pranav','Mayur','Kunal','Shashi']
p_role = ['DS','SW','GD','RE','TS']

In [3]:
d1 ={"Id" : p_id,"Name" : p_name,"Role" : p_role}

In [4]:
Person = pd.DataFrame(d1)

In [5]:
Person

     Id    Name Role
0  2000   Veman   DS
1  2001  Pranav   SW
2  2002   Mayur   GD
3  2003   Kunal   RE
4  2004  Shashi   TS

In [6]:
Person["Age"]=[20,21,25,23,27] # adding one more columns

In [7]:
Person

     Id    Name Role  Age
0  2000   Veman   DS   20
1  2001  Pranav   SW   21
2  2002   Mayur   GD   25
3  2003   Kunal   RE   23
4  2004  Shashi   TS   27

In [8]:
Person.shape

(5, 4)

In [9]:
#renameing columns

In [10]:
Person.rename(columns={"Id" : "Roll_no"},inplace= True)

In [11]:
Person

   Roll_no    Name Role  Age
0     2000   Veman   DS   20
1     2001  Pranav   SW   21
2     2002   Mayur   GD   25
3     2003   Kunal   RE   23
4     2004  Shashi   TS   27

In [12]:
p_uid = [1,2,3,4,5]
Roll_no = [2000,2001,2001,2000,2003]
p_units = [30,2,78,35,25]
p_name = ["Clothing","Foods","Wearables","Gifting","Acessories"]

In [13]:
d2 = {"uid":p_uid,"id":p_id,"units":p_units,"name":p_name}

In [14]:
d2

{'uid': [1, 2, 3, 4, 5],
 'id': [2000, 2001, 2002, 2003, 2004],
 'units': [30, 2, 78, 35, 25],
 'name': ['Clothing', 'Foods', 'Wearables', 'Gifting', 'Acessories']}

In [15]:
D2 = pd.DataFrame(d2)

In [16]:
D2

   uid    id  units        name
0    1  2000     30    Clothing
1    2  2001      2       Foods
2    3  2002     78   Wearables
3    4  2003     35     Gifting
4    5  2004     25  Acessories

D2.shape

In [17]:
D2.columns

Index(['uid', 'id', 'units', 'name'], dtype='object')

In [18]:
#print details of id number 100
[D2["id"]==2000]

[0     True
 1    False
 2    False
 3    False
 4    False
 Name: id, dtype: bool]

In [19]:
D2[D2["id"]==2000]

   uid    id  units      name
0    1  2000     30  Clothing

In [20]:
#printing only name of the prodct

D2[D2["id"]==2003]["name"]

3    Gifting
Name: name, dtype: object

In [33]:
p_id = [100,101,102,103,104]
p_name = ['Shampoo','Deodrant','Toothpaste','Soap','Hairgel']
p_role = ['DS','SW','GD','RE','TS']
p_price = [50,30,50,70,40]

In [35]:
a1 = {"pid":p_id,"pname":p_name,"prole":p_role,"price":p_price}

In [36]:
Product = pd.DataFrame(a1)

In [37]:
Product

   pid       pname prole  price
0  100     Shampoo    DS     50
1  101    Deodrant    SW     30
2  102  Toothpaste    GD     50
3  103        Soap    RE     70
4  104     Hairgel    TS     40

In [38]:
p_uid = [1,2,3,4,5]
p_pid = [101,101,103,101,103]
p_units = [30,2,78,35,25]
p_name = ["Clothing","Foods","Wearables","Gifting","Acessories"]

In [42]:
a2={"id":p_uid,"pid":p_pid,"units":p_units,"name":p_name}

In [43]:
Order = pd.DataFrame(a2)

In [44]:
Order

   id  pid  units        name
0   1  101     30    Clothing
1   2  101      2       Foods
2   3  103     78   Wearables
3   4  101     35     Gifting
4   5  103     25  Acessories

In [51]:
#merging columns

#applying inner joing
pd.merge(Product, Order, how="inner", on="pid")

   pid     pname prole  price  id  units        name
0  101  Deodrant    SW     30   1     30    Clothing
1  101  Deodrant    SW     30   2      2       Foods
2  101  Deodrant    SW     30   4     35     Gifting
3  103      Soap    RE     70   3     78   Wearables
4  103      Soap    RE     70   5     25  Acessories

In [52]:
pd.merge(Product, Order, how="left", on="pid")

   pid       pname prole  price   id  units        name
0  100     Shampoo    DS     50  NaN    NaN         NaN
1  101    Deodrant    SW     30  1.0   30.0    Clothing
2  101    Deodrant    SW     30  2.0    2.0       Foods
3  101    Deodrant    SW     30  4.0   35.0     Gifting
4  102  Toothpaste    GD     50  NaN    NaN         NaN
5  103        Soap    RE     70  3.0   78.0   Wearables
6  103        Soap    RE     70  5.0   25.0  Acessories
7  104     Hairgel    TS     40  NaN    NaN         NaN

In [53]:
pd.merge(Product, Order, how="right", on="pid")

   pid     pname prole  price  id  units        name
0  101  Deodrant    SW     30   1     30    Clothing
1  101  Deodrant    SW     30   2      2       Foods
2  103      Soap    RE     70   3     78   Wearables
3  101  Deodrant    SW     30   4     35     Gifting
4  103      Soap    RE     70   5     25  Acessories

In [55]:
Order

   id  pid  units        name
0   1  101     30    Clothing
1   2  101      2       Foods
2   3  103     78   Wearables
3   4  101     35     Gifting
4   5  103     25  Acessories

In [56]:
#adding new row

new_row = {"id":6,"pid":102,"units":20,"name":"Gaming"}

In [57]:
new_df = pd.DataFrame(new_row,index = [5])

In [59]:
pd.concat([Order,new_df],axis = 0)

   id  pid  units        name
0   1  101     30    Clothing
1   2  101      2       Foods
2   3  103     78   Wearables
3   4  101     35     Gifting
4   5  103     25  Acessories
5   6  102     20      Gaming

In [60]:
#creating a another column df2 to merge pdf

In [61]:
df2=pd.merge(Product,Order,how = "right",on="pid")

In [62]:
df2["total_price"]=df2["price"]*df2["units"]

In [64]:
Order["total_price"] = df2["total_price"]

In [65]:
Order

   id  pid  units        name  total_price
0   1  101     30    Clothing          900
1   2  101      2       Foods           60
2   3  103     78   Wearables         5460
3   4  101     35     Gifting         1050
4   5  103     25  Acessories         1750

In [72]:
empcode = [101,102,103,104,105]
empcode

[101, 102, 103, 104, 105]

In [71]:
empcode = np.array([101,102,103,104,105])
empcode

array([101, 102, 103, 104, 105])

In [73]:
empname = np.array(["Veman","Sourabh","Harsh","Vivek","Aryan"])

In [74]:
empname

array(['Veman', 'Sourabh', 'Harsh', 'Vivek', 'Aryan'], dtype='<U7')

In [87]:
empcol = pd.Series(empname,empcode)

In [88]:
empcol

101      Veman
102    Sourabh
103      Harsh
104      Vivek
105      Aryan
dtype: object

In [85]:
empcol = pd.Series(empname,index=empcode)

In [86]:
empcol

101      Veman
102    Sourabh
103      Harsh
104      Vivek
105      Aryan
dtype: object

In [91]:
designation = pd.Series(["DS","AS","FD","WE","JH"],index = empcode)

In [94]:
designation

101    DS
102    AS
103    FD
104    WE
105    JH
dtype: object

In [95]:
age = pd.Series([20,24,23,21,26])

In [96]:
age

0    20
1    24
2    23
3    21
4    26
dtype: int64

In [97]:
age = pd.Series([20,24,23,21,26],index = empcode)
age

101    20
102    24
103    23
104    21
105    26
dtype: int64

In [98]:
d1 = {"Empname":empcol,"Designation":designation,"Age":age}
d1

{'Empname': 101      Veman
 102    Sourabh
 103      Harsh
 104      Vivek
 105      Aryan
 dtype: object,
 'Designation': 101    DS
 102    AS
 103    FD
 104    WE
 105    JH
 dtype: object,
 'Age': 101    20
 102    24
 103    23
 104    21
 105    26
 dtype: int64}

In [100]:
df = pd.DataFrame(d1)

In [101]:
df

     Empname Designation  Age
101    Veman          DS   20
102  Sourabh          AS   24
103    Harsh          FD   23
104    Vivek          WE   21
105    Aryan          JH   26

In [105]:
df.shape

(5, 3)

In [106]:
df.columns

Index(['Empname', 'Designation', 'Age'], dtype='object')

In [107]:
df.head(2)

     Empname Designation  Age
101    Veman          DS   20
102  Sourabh          AS   24

In [108]:
df.tail()

     Empname Designation  Age
101    Veman          DS   20
102  Sourabh          AS   24
103    Harsh          FD   23
104    Vivek          WE   21
105    Aryan          JH   26

In [109]:
## exercise
first_name = ["Richie","Mark"]
nums = [800678,800456]

In [110]:
series_1 = pd.Series(nums)
series_1

0    800678
1    800456
dtype: int64

In [111]:
series_2 = pd.Series(nums,index = first_name)
series_2

Richie    800678
Mark      800456
dtype: int64

In [112]:
df

     Empname Designation  Age
101    Veman          DS   20
102  Sourabh          AS   24
103    Harsh          FD   23
104    Vivek          WE   21
105    Aryan          JH   26

In [113]:
df.T

               101      102    103    104    105
Empname      Veman  Sourabh  Harsh  Vivek  Aryan
Designation     DS       AS     FD     WE     JH
Age             20       24     23     21     26

In [114]:
df.dtypes

Empname        object
Designation    object
Age             int64
dtype: object

In [116]:
df.Empname

101      Veman
102    Sourabh
103      Harsh
104      Vivek
105      Aryan
Name: Empname, dtype: object

In [117]:
df["Empname"]

101      Veman
102    Sourabh
103      Harsh
104      Vivek
105      Aryan
Name: Empname, dtype: object

In [119]:
df[["Empname","Designation"]]

     Empname Designation
101    Veman          DS
102  Sourabh          AS
103    Harsh          FD
104    Vivek          WE
105    Aryan          JH

In [120]:
df.loc[[101,102]]

     Empname Designation  Age
101    Veman          DS   20
102  Sourabh          AS   24

In [125]:
df.loc[102:104,["Empname"]]

     Empname
102  Sourabh
103    Harsh
104    Vivek